#!/usr/bin/env python
# _*_ coding: utf-8 _*_
#Author: zhangyawei
'''
## 收集回文数

回文数是指正序（从左到右）读和倒序（从右到左）读都是一样的整数，例如121、1221。

请在右侧编写代码，获取多行输入，每行输入包含一个整数，请收集所有输入内容中的回文数，并以空格分隔数字的形式输出一行字符串。

#### 示例

输入：

> 12
>
> 121
>
> 1234
>
> 1221
>
> 13131

输出：

> 121 1221 13131

'''

import sys
huiwen_list = []
for i in sys.stdin:
    i = i.strip()
    ii = i[::-1]
    if ii == i:
        huiwen_list.append(i)

print(" ".join(huiwen_list))



"""
12
121
1234
1221
13131
1111
22
15151
12345
1001
2332
6780
10
23932
1238
9381
129921
"""